[
  {
    "id": "8ca85888-e6cf-429e-a926-07189bf17536",
    "title": "Features that keep your workflow clean",
    "description": "EmbodiCMS works directly with Astro's content collections and GitHub. One instance handles all your projects without the complexity or infrastructure overhead.",
    "features": [
      {
        "title": "Automatic editing interface from your content schema",
        "description": "Install the Vite plugin and EmbodiCMS generates your content editor directly from Astro's content collections. Define your schema once in Astro, get a working editor automatically. No duplicate schemas, no configuration drift.",
        "icon": "bx:bxs-briefcase"
      },
      {
        "title": "Content lives in your GitHub repository",
        "description": "Every edit becomes a Git commit in your repository. Full version history, branch workflows, and complete ownership of your content. Switch tools later? Your content is just markdown and JSON files—no database exports or migration pain.",
        "icon": "bx:bxs-window-alt"
      },
      {
        "title": "Rich text editing without markdown syntax",
        "description": "Content editors get a clean WYSIWYG interface powered by Milkdown. Format text, add links, insert images—no need to learn markdown syntax or remember formatting codes.",
        "icon": "bx:bxs-data"
      },
      {
        "title": "Support for multiple content formats",
        "description": "Works with markdown (.md), YAML (.yaml), and JSON (.json) files. Whether you're managing blog posts, data files, or configuration, EmbodiCMS handles your content structure.",
        "icon": "bx:bxs-bot"
      },
      {
        "title": "File and glob collections",
        "description": "Supports both Astro's file-based collections (one file per entry) and glob collections (structured data files). Edit individual blog posts or manage site-wide data—your content structure, your choice.",
        "icon": "bx:bxs-file-find"
      },
      {
        "title": "GitHub-based permissions",
        "description": "User access is managed through GitHub repository permissions. No separate user management system to maintain. Team members with repo access can edit content, others can't. Simple.",
        "icon": "bx:bxs-user"
      },
      {
        "title": "One instance, all your projects",
        "description": "Run a single EmbodiCMS instance (hosted or self-hosted) and edit content across multiple projects. No need to deploy and maintain separate installations for each site.",
        "icon": "bx:bxs-bot"
      },
      {
        "title": "No server infrastructure required",
        "description": "EmbodiCMS is a UI layer over your Git repository. No databases to back up, no application servers to scale, no infrastructure to maintain. Use the hosted version or run it yourself—either way, it's lightweight.",
        "icon": "bx:bxs-file-find"
      },
      {
        "title": "Built for Astro's content collections",
        "description": "First-class integration with Astro's native content collection system. If you're already using Astro content collections, EmbodiCMS already understands your content structure.",
        "icon": "bx:bxs-user"
      },
      {
        "title": "Image uploads",
        "description": "First-class integration with Astro's native content collection system. If you're already using Astro content collections, EmbodiCMS already understands your content structure.",
        "icon": "lucide:image-up"
      },
      {
        "title": "Open source",
        "description": "The full codebase is open source. Inspect it, modify it, contribute to it. No black box, no vendor lock-in beyond GitHub as your content storage.",
        "icon": "lucide:package-open"
      }
    ]
  }
]
